app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "tedesco.1635912@studenti.uniroma1.it"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
         def self.from_omniauth(access_token)
          data = access_token.info
          user = User.where(email: data['email']).first

          # Uncomment the section below if you want users to be created if they don't exist
          unless user
              user = User.create(email: data['email'], password: Devise.friendly_token[0,20])