app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def google_oauth2
        # You need to implement the method below in your model (e.g. app/models/user.rb)
        @user = User.from_omniauth(request.env['omniauth.auth'])

        if @user.persisted?
          flash[:notice] = I18n.t 'devise.omniauth_callbacks.success', kind: 'Google'
          auth = request.env["omniauth.auth"]                   # RICHIEDO A GOOGLE HASH DI AUTORIZZAZIONE(CONTIENE I DATI DEL PROFILO GOOGLE DELL'UTENTE)
          @user.access_token = auth.credentials.token           # AGGIUNGO ACCESS TOKEN UTENTE AL DATABASE
          @user.expires_at = auth.credentials.expires_at        # AGGIUNGO DATA SCADENZA TOKEN UTENTE AL DATABASE
          @user.refresh_token = auth.credentials.refresh_token  # AGGIUNGO TOKEN DI REFRESH AL DATABASE
          @user.provider = "Google"
          @user.save!